# DividedSurfaceTotalEdgeLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfaceTotalEdgeLength Property
ParameterTypeId Class See Also
---
"Total edge length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfaceTotalEdgeLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceTotalEdgeLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfaceTotalEdgeLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace